Masmiseim36/nxpSDK/boards/frdmke15z/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_FTM(void);

/*! @name PORTC6 (number 81), UART1_RX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_UART_DEBUG_UART_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_UART_DEBUG_UART_RX_PIN 6U                   /*!<@brief PORT pin number */
#define PINTOOL_UART_DEBUG_UART_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTC7 (number 80), UART1_TX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_UART_DEBUG_UART_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_UART_DEBUG_UART_TX_PIN 7U                   /*!<@brief PORT pin number */
#define PINTOOL_UART_DEBUG_UART_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

/*! @name PORTB11 (number 74), SW2
  @{ */

/* Symbols to be used with GPIO driver */
#define PINTOOL_MISC_SW2_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define PINTOOL_MISC_SW2_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define PINTOOL_MISC_SW2_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PINTOOL_MISC_SW2_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define PINTOOL_MISC_SW2_PIN 11U                   /*!<@brief PORT pin number */
#define PINTOOL_MISC_SW2_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTD0 (number 4), D4[1]/RGB_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define PINTOOL_MISC_LED_RED_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define PINTOOL_MISC_LED_RED_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define PINTOOL_MISC_LED_RED_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PINTOOL_MISC_LED_RED_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_MISC_LED_RED_PIN 0U                   /*!<@brief PORT pin number */
#define PINTOOL_MISC_LED_RED_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD3 (number 70), SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define PINTOOL_MISC_SW3_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define PINTOOL_MISC_SW3_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define PINTOOL_MISC_SW3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PINTOOL_MISC_SW3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_MISC_SW3_PIN 3U                   /*!<@brief PORT pin number */
#define PINTOOL_MISC_SW3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTD16 (number 21), D4[4]/RGB_GREEN
  @{ */

/* Symbols to be used with GPIO driver */
#define PINTOOL_MISC_LED_GREEN_FGPIO FGPIOD              /*!<@brief FGPIO peripheral base pointer */
#define PINTOOL_MISC_LED_GREEN_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define PINTOOL_MISC_LED_GREEN_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PINTOOL_MISC_LED_GREEN_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define PINTOOL_MISC_LED_GREEN_PIN 16U                   /*!<@brief PORT pin number */
#define PINTOOL_MISC_LED_GREEN_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
